Repository: DataManagementLab/ppsv
Catalog: ppsv/student/locale/*/LC_MESSAGES/django.po
Languages: de_de

source: Your input does not follow the typical format of a TU ID. In case you are sure your input was correct nevertheless, please contact the organizers.
de_de: Deine Eingabe hat nicht das typische Format einer TU-ID. Wenn du dir sicher bist, dass die Eingabe dennoch korrekt ist, kontaktiere bitte das Orgateam.

source: Group members
de_de: Gruppenmitglieder

source: Specify other group members here (if applicable)
de_de: Weitere Gruppenmitglieder angeben (wenn zutreffend)

source: Available topics
de_de: Verfügbare Themen

source: Selected topics
de_de: Gewählte Themen

source: Complete Profile
de_de: Profil vervollständigen

source: Please enter your TU-ID to complete the profile creation for this registration system.
de_de: Bitte TU-ID eingeben, um die Profilerstellung für dieses Registrierungssystem abzuschließen.

source: Set & Continue
de_de: Speichern & Fortfahren

source: Edit Profile
de_de: Profil bearbeiten

source: Save
de_de: Speichern

source: Select Group Members
de_de: Gruppenmitglieder auswählen

source: Continue
de_de: Fortfahren

source: Login Required
de_de: Login benötigt

source: Please log in to view this page
de_de: Bitte einloggen, um diese Seite zu sehen

source: Overview
de_de: Übersicht

source: Edit
de_de: Bearbeiten

source: Invalid registration, you did not select any topics yet
de_de: Ungültige Registrierung, noch keine Themen ausgewählt

source: Edit selection
de_de: Wahl bearbeiten

source: Withdraw registration
de_de: Registrierung zurückziehen

source: Start new registration
de_de: Neue Registrierung beginnen

source: Select Topics
de_de: Themen auswählen

source: Select at least one topic. A higher number of choices will increase the chance that we can assign you a topic. Put your highest priority first.
de_de: Mindestens ein Thema auswählen. Eine höhere Anzahl ausgewählter Themen erhöht die Wahrscheinlichkeit, dass wir ein Thema zuweisen können. Das Thema mit der höchsten Priorität bitte zuerst angeben.

source: You have to select at least one topic
de_de: Es muss mindestens ein Thema ausgewählt werden

source: Profile information saved
de_de: Profilinformationen gespeichert

source: Profile updated
de_de: Profil aktualisiert

source: Group members updated
de_de: Gruppenmitglieder aktualisiert

source: Registration saved
de_de: Registrierung gespeichert

source: Withdraw registration?
de_de: Registrierung zurückziehen?

source: Registration withdrawn
de_de: Registrierung zurückgezogen
