Repository: DataManagementLab/ppsv
Catalog: ppsv/frontend/locale/*/LC_MESSAGES/django.po
Languages: de

source: username
de: Benutzername

source: <div style="padding-left: 10px"><small>Letters, numbers and @/./+/-/_ only.</small></div>
de: <div style="padding-left: 10px"><small>Nur Buchstaben, Zahlen und @/./+/-/_ sind erlaubt.</small></div>

source: password
de: Passwort

source: confirm password
de: Passwort bestätigen

source: <div style="padding-left: 10px"><small>The password must not contain any personal information.<br>The password has to be at least 8 digits long.<br>The password must not be commonly used.<br>The password must not contain only numbers.</small></div>
de: <div style="padding-left: 10px"><small>Das Passwort darf nicht zu ähnlich zu anderen Informationen sein. <br>Das Passwort muss mindestens 8 Zeichen enthalten.<br>Das Passwort darf nicht allgemein üblich sein.<br>Das Passwort darf nicht komplett aus Ziffern bestehen.</small></div>

source: first name
de: Vorname

source: last name
de: Nachname

source: Internship & Seminar Allocation
de: Praktika- & Seminarplatzvergabe

source: You are not logged in.
de: Du bist nicht eingeloggt.

source: Overview
de: Übersicht

source: My Selection
de: Meine Auswahl

source: My Groups
de: Meine Gruppen

source: Create a new group
de: Neue Gruppe erstellen

source: Cancel
de: Abbrechen

source: Create new group
de: Neue Gruppe erstellen

source: Are you sure
de: Bist du sicher,

source: you want to delete this group?
de: dass du diese Gruppe löschen möchtest?

source: Delete
de: Löschen

source: Edit Group
de: Gruppe bearbeiten

source: Delete Group
de: Gruppe löschen

source: If you remove this member, your group will be too small and will be deleted.
de: Wenn du dieses Mitglied entfernst, ist die Gruppe zu klein und wird gelöscht.

source: Duplicates are not allowed! If you remove this member, another group will have the same members as this group.
de: Identische Gruppen sind nicht erlaubt! Wenn du dieses Mitglied entfernst, ist diese Gruppe identisch zu einer anderen.

source: Delete this group
de: Diese Gruppe löschen

source: What to do next
de: Deine nächsten Schritte

source: or
de: oder

source: You do not have an account yet?
de: Du hast noch keinen Account?

source: Register
de: Registrieren

source: Welcome
de: Willkommen

source: This website serves as a platform for registering for seminars, internships and other courses. You can select topics and prioritize them across multiple courses.
de: Diese Website dient als Plattform zur Anmeldung für Seminare, Praktika und andere Veranstaltungen. Hier kannst Du Themen wählen und über mehrere Veranstaltungen hinweg priorisieren.

source: Select Topic
de: Thema wählen

source: Choose a Course
de: Wähle einen Kurs

source: Choose a Topic
de: Wähle ein Thema

source: Choose a Faculty
de: Wähle einen Fachbereich

source: Information for Course
de: Kursinformationen

source: Organizer
de: Organisierende

source: Course Type
de: Kursart

source: Faculty
de: Fachbereich

source: Language
de: Sprache

source: Registration
de: Registrierung

source: Motivation Text
de: Motivationstext

source: required
de: erforderlich

source: not required
de: nicht erforderlich

source: Description
de: Beschreibung

source: Select all remaining topics of this course
de: Wähle alle übrigen Themen dieses Kurses

source: Title
de: Titel

source: Min | Max Participants
de: Min | Max Teilnehmerzahl

source: Max Participants
de: Max Teilnehmerzahl

source: Choose a group
de: Wähle eine Gruppe

source: Select topic with chosen group
de: Mit ausgewählter Gruppe wählen

source: Select with group
de: Mit Gruppe auswählen

source: You cannot choose this topic yet. The registration for this topic starts on
de: Du kannst dieses Thema noch nicht wählen. Die Anmeldung beginnt am

source: You cannot choose this topic anymore.
de: Dieses Thema kann nicht mehr gewählt werden.

source: Select with a group
de: Mit Gruppe wählen

source: Select without a group
de: Alleine wählen

source: Select topic
de: Thema wählen

source: Group members:
de: Gruppenmitglieder:

source: Select with this group
de: Mit dieser Gruppe wählen

source: Your group for this course is too big for this topic.
de: Deine Gruppe für den Kurs ist zu groß für dieses Thema.

source: selected
de: gewählt

source: View My Selection
de: Meine Auswahl ansehen

source: You need to be logged in to select a topic.
de: Du musst eingeloggt sein, um ein Thema auswählen zu können.

source: You need to be a student to select a topic.
de: Du musst ein Studierendenprofil haben, um ein Thema auswählen zu können.

source: There are no topics in this course.
de: In diesem Kurs gibt es keine verfügbaren Themen.

source: Information for Topic
de: Themeninformationen

source: Type
de: Art

source: Registration End
de: Anmeldeschluss

source: Open
de: Offen

source: Imminent
de: In Kürze

source: Upcoming
de: Bald

source: Closed
de: Geschlossen

source: There are no courses in this faculty right now.
de: In diesem Fachbereich gibt es momentan keine verfügbaren Kurse.

source: Edit Collections
de: Collections bearbeiten

source: Assign these topics to your desired collections
de: Weise diese Themen zu deinen gewünschten Collections zu

source: You need to assign this topic to a collection
de: Dieses Thema muss noch einer Collection zugewiesen werden.

source: Choose collection
de: Collection wählen

source: Move to selected collection
de: In gewählte Collection verschieben

source: Remove Topic
de: Thema löschen

source: Delete collection
de: Collection löschen

source: You need to set the priority for this topic and write a motivation text.
de: Für dieses Thema muss noch eine Priorität und ein Motivationstext gesetzt werden.

source: You need to set the priority for this topic.
de: Für dieses Thema muss noch eine Priorität gesetzt werden.

source: You need to write a motivation text.
de: Du musst einen Motivationstext schreiben.

source: Save Motivation Text
de: Motivationstext speichern

source: Edit Motivation Text
de: Motivationstext bearbeiten

source: Show Details
de: Details anzeigen

source: Discard Changes
de: Änderungen verwerfen

source: If you delete this collection, all selections in this collection will be deleted
de: Wenn du diese Collection löschst, werden alle gewählten Themen darin entfernt.

source: Delete Collection
de: Collection löschen

source: Add Collection
de: Collection hinzufügen

source: Add new collection
de: Neue Collection hinzufügen

source: I don't have an account.
de: Ich habe keinen Account.

source: Create your student profile
de: Erstellung eines Studierendenprofils

source: This information cannot be changed later!
de: Diese Daten können später nicht mehr geändert werden!

source: Save profile permanently
de: Profil unwiderruflich speichern

source: Create an account
de: Account erstellen

source: If you already have an account,
de: Wenn du bereits einen Account hast:

source: You still need to write one or more motivation texts!
de: Du musst noch mind. einen Motivationstext schreiben!

source: There is at least one collection that has mixed course types!
de: Mindestens eine Collection hat gemischte Kursarten!

source: You have not selected any topics yet!
de: Du hast noch keine Themen gewählt!

source: You can view and manage your selected topics and collections here:
de: Hier kannst Du deine gewählten Themen und Collections sehen und verwalten:

source: You can create a group here:
de: Hier kannst Du eine Gruppe erstellen:

source: Your selection was successful! You can find and edit your chosen topics on the "My Selection" page.
de: Die Auswahl war erfolgreich! Du kannst nun die ausgewählten Themen unter "Meine Auswahl" ansehen und bearbeiten.

source: Could not select any new topics!
de: Es konnten keine neuen Themen gewählt werden!

source: There was at least one topic that could not be selected because it does not have enough space for your group.
de: Es gab mind. ein Thema, das nicht gewählt werden konnte, da es nicht genug Platz für deine Gruppe hat.

source: Your selection was successful! You can prioritize and edit your chosen topics on the 'My Selection' page.
de: Die Auswahl war erfolgreich! Du kannst nun die ausgewählten Themen unter "Meine Auswahl" priorisieren und bearbeiten.

source: You need to add a motivation text to your selection in order to fully complete your selection.
de: Du musst noch einen Motivationstext zum ausgewählten Thema hinzufügen, um die Wahl abzuschließen. Dies kannst du unter "Meine Auswahl" tun.

source: Selection failed! You have already selected this topic.
de: Die Auswahl ist fehlgeschlagen! Du hast diesen Kurs bereits gewählt.

source: You need to add a motivation text (when required) to your selection in order to fully complete your selection. You can do this on the "My Selection" page.
de: Du musst noch, falls nötig, einen Motivationstext zum ausgewählten Kurs hinzufügen, um die Wahl abzuschließen.Dies kannst du unter "Meine Auswahl" tun.

source: You already have selected a topic from the same course with a group.
de: Du hast bereits ein Thema aus dem gleichen Kurs mit einer Gruppe gewählt.

source: A member of your group has already selected this topic or a topic in this course.
de: Ein Mitglied deiner Gruppe hat bereits dieses Thema gewählt oder mit einer anderen Gruppe diesen Kurs gewählt.

source: A student with the TUCaN-ID
de: Ein:e Student:in mit der TUCaN-ID

source: was not found.
de: konnte nicht gefunden werden.

source: Your group would be too large for
de: Deine Gruppe wäre zu groß für

source: . Your group can only have a maximum of
de: . Deine Gruppe kann maximal aus

source: members.
de: Mitgliedern bestehen.

source: is already in the group.
de: ist bereits in deiner Gruppe.

source: Your group needs to contain more members than yourself!
de: Deine Gruppe muss mehr Personen beinhalten, als nur dich selbst!

source: This group already exists!
de: Diese Gruppe existiert bereits!

source: A member of the group you are trying to create has already selected this topic or a topic in this course.
de: Ein Mitglied der Gruppe hat bereits dieses Thema oder ein anderes Thema in dem Kurs gewählt.

source: Please create a student profile before selecting courses.
de: Bitte erstelle zunächst ein Studierendenprofil, bevor Du mit deiner Wahl beginnst.

source: Your motivation text has been saved.
de: Dein Motivationstext wurde gespeichert.

source: Automatically assigned topics from the same course to a matching collection
de: Alle Themen aus demselben Kurs wurden automatisch in die passende Collection verschoben

source: Automatically assigned "
de: Das Thema "

source: " to a matching collection
de: " wurde der passenden Collection zugewiesen

source: Please create a student profile before accessing your groups.
de: Bitte erstelle ein Studierendenprofil, bevor du auf deine Gruppen zugreifst.

source: does not exist.
de: existiert nicht.

source: Group has been created.
de: Die Gruppe wurde erstellt.

source: Adding {} would make this group a duplicate of an already existing one.
de: Hinzufügen von {} würde die Gruppe zu einem Duplikat machen.

source: {} is already a member of this group.
de: {} ist bereits in deiner Gruppe.

source: A student with the TUCaN-ID {} does not exist.
de: Ein:e Student:in mit der TUCaN-ID

source: You are now logged in as {}.
de: Du bist nun angemeldet als {}.

source: Invalid username or password.
de: Benutzername oder Passwort sind falsch.

source: You have successfully logged out.
de: Du hast dich erfolgreich ausgeloggt.

source: Registration successful.
de: Registrierung erfolgreich.

source: Unsuccessful registration. Invalid information.
de: Die Registrierung ist fehlgeschlagen. Unzulässige Angaben..

source: Student profile has been saved successfully.
de: Das Studierendenprofil wurde erfolgreich gespeichert.

source: Student profile could not be saved. A user can only create one student.
de: Das Studierendenprofil konnte nicht gespeichert werden. Jeder Account kann nur eins erstellen.

source: Saving unsuccessful. Invalid information.
de: Speichern fehlgeschlagen. Ungültige Angaben.
